BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_I2C.c
// CRC: 5D982BB222882C54AB4AFF20A1590FC484D3178BD0D2510D0F5A64A7853221CAE2C33FABBE4F69A6659399D51781B7B9FAE5D3E402C32CC04ABA32A404641158F3C76BAD8EEF9A81C5BD6FC7FBC82BBEEAB3A14A2A013993711B8143522C2B69417AB4CCDCA5CF90AD633EAD1005C88DA1E994E8F962379A1A43050764A6D5D2FB0A86A9262D33DE92D3B16C61E06CBF9453BD3865BEA8FC770F7308D717B43404E4E7B06660D0EC15E4E834F41915C4B9E670B98ED97111549D34A0D5AD11F377C4C6DC9CB40069C74E90637F1EE8148645CB606C1E817EACA9CE2DF1EA8436E42CFE37638C9748
// REVISION: 2.0
// GUID: 30D6EA9C-37DA-48CF-A047-E5AA1F247330
// DATE: 20\01\2023
// DIR: CAL\PIC16BIT\PIC16BIT_CAL_I2C.c
/*********************************************************************
 *                  Flowcode CAL I2C File
 *
 * File: PIC16BIT_CAL_I2C.c
 *
 * (c) 2011 Matrix Multimedia Ltd.
 * http://www.matrixmultimedia.com
 *
 * Software License Agreement
 *
 * The software supplied herewith by Matrix Multimedia Ltd (the
 * “Company”) for its Flowcode graphical programming language is
 * intended and supplied to you, the Company’s customer, for use
 * solely and exclusively on the Company's products. The software
 * is owned by the Company, and is protected under applicable
 * copyright laws. All rights are reserved. Any use in violation
 * of the foregoing restrictions may subject the user to criminal
 * sanctions under applicable laws, as well as to civil liability
 * for the breach of the terms and conditions of this licence.
 *
 * THIS SOFTWARE IS PROVIDED IN AN “AS IS” CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * Changelog:
 *
 *  date  | by | description
 * -------+----+-----------------------------------------------------
 * 230911 | BR | Created
 * 020312 | BR | Updated to v5.1 CAL Schema
 * 040912 | BR | Minor mod to switch I2C registers based on dsPIC30F target definition
 * 030713 | LM | Standard API calls
 * 280813 | LM | Removed unused defines
 * 071013 | LM | fix for single I2C channel
 * 071013 | LM | Fixed Baud Rate Generator value
 * 260914 | LM | Changes to Slave macro API
 * 021014 | LM | Implemented Slave functionality
 * 220118 | LM | Addition of transaction functions
 *
 */



#define MX_I2C_CHANNEL_X		CAL_APPEND(MX_I2C_CHANNEL_, MX_I2C_NUM)
#define MX_I2C_SDA_PIN_X		CAL_APPEND(MX_I2C_SDA_PIN_, MX_I2C_NUM)
#define MX_I2C_SDA_PORT_X		CAL_APPEND(MX_I2C_SDA_PORT_, MX_I2C_NUM)
#define MX_I2C_SDA_TRIS_X		CAL_APPEND(MX_I2C_SDA_TRIS_, MX_I2C_NUM)
#define MX_I2C_SCL_PIN_X		CAL_APPEND(MX_I2C_SCL_PIN_, MX_I2C_NUM)
#define MX_I2C_SCL_PORT_X		CAL_APPEND(MX_I2C_SCL_PORT_, MX_I2C_NUM)
#define MX_I2C_SCL_TRIS_X		CAL_APPEND(MX_I2C_SCL_TRIS_, MX_I2C_NUM)
#define MX_I2C_BMODE_X			CAL_APPEND(MX_I2C_BMODE_, MX_I2C_NUM)
#define MX_I2C_BAUD_X			CAL_APPEND(MX_I2C_BAUD_, MX_I2C_NUM)
#define MX_I2C_INT_X			CAL_APPEND(MX_I2C_INT_, MX_I2C_NUM)
#define MX_I2C_STOPDEL_X		CAL_APPEND(MX_I2C_STOPDEL_, MX_I2C_NUM)
#define MX_I2C_CLKSTRCH_X		CAL_APPEND(MX_I2C_CLOCKSTRETCHING_, MX_I2C_NUM)


//Function Prototypes
CALFUNCTION(void, FC_CAL_I2C_Master_Init_, (void));
CALFUNCTION(void, FC_CAL_I2C_Master_Uninit_, (void));
CALFUNCTION(void, FC_CAL_I2C_Master_Start_, (void));
CALFUNCTION(void, FC_CAL_I2C_Master_Restart_, (void));
CALFUNCTION(void, FC_CAL_I2C_Master_Stop_, (void));
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Master_TxByte_, (MX_UINT8 Data));
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Master_RxByte_, (MX_UINT8 Last));

CALFUNCTION(void, FC_CAL_I2C_Slave_Init_, (MX_UINT8 Address, MX_UINT8 Mask));
CALFUNCTION(void, FC_CAL_I2C_Slave_Uninit_, (void));
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_TxByte_, (MX_UINT8 Data));
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_RxByte_, (MX_UINT8 Last));
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_Status_, (void));

CALFUNCTION(MX_UINT8, FC_CAL_I2C_Transaction_Init_,   (MX_UINT8 SlaveAddress));
CALFUNCTION(MX_UINT16, FC_CAL_I2C_Transaction_Read_,   (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length));
CALFUNCTION(MX_UINT16, FC_CAL_I2C_Transaction_Write_,  (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length));
CALFUNCTION(void,     FC_CAL_I2C_Transaction_Uninit_, (void));


//I2C Timeout - Avoids any blocking delays
#define MX_I2C_TIMEOUT_X		CAL_APPEND(MX_I2C_TIMEOUT_, MX_I2C_NUM)
MX_UINT16 MX_I2C_TIMEOUT_X;

//Ensure I2C1CON registers are defined correctly
#if (defined _I2CADD)
	#define I2C1RCV			I2CRCV
	#define I2C1TRN			I2CTRN
	#define I2C1BRG			I2CBRG
	#define I2C1CON			I2CCON
	#define I2C1STAT		I2CSTAT
	#define I2C1ADD			I2CADD
	#define I2C1RCVbits		I2CRCVbits
	#define I2C1TRNbits		I2CTRNbits
	#define I2C1BRGbits		I2CBRGbits
	#define I2C1CONbits		I2CCONbits
	#define I2C1STATbits	I2CSTATbits
	#define I2C1ADDbits		I2CADDbits
#endif

#if (!defined I2C1CON)
	#if (defined I2C1CON1)
		#define I2C1CON     I2C1CON1
		#define I2C1CONbits I2C1CON1bits
	#endif
#endif

#if (!defined I2C2CON)
	#if (defined I2C2CON1)
		#define I2C2CON     I2C2CON1
		#define I2C2CONbits I2C2CON1bits
	#endif
#endif

//If software channel is enabled then define bit delay.
#if (MX_I2C_CHANNEL_X == 0)
  #ifndef MX_I2C_SW_DEL
	#define MX_I2C_SW_DEL
	#define MX_I2C_SW_BAUD	((500000 / MX_I2C_BAUD_X)-1)

	#if (MX_I2C_SW_BAUD < 1)
		#define MX_I2C_DELAY	delay_us(1);
	#else
		#define MX_I2C_DELAY	delay_us(MX_I2C_SW_BAUD);
	#endif
  #endif
#else
  #define MX_I2C_HW_BAUD	((MX_CLK_SPEED / MX_CLKS_PER_INST) / MX_I2C_BAUD_X) - 2

  //Check for rollover
  #if MX_I2C_HW_BAUD > 511
  	#undef MX_I2C_HW_BAUD
  	#define MX_I2C_HW_BAUD 511
  #endif
#endif


CALFUNCTION(void, FC_CAL_I2C_Master_Init_, (void))
{

	#if (MX_I2C_CHANNEL_X == 0)															//Use Master I2C Software
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Configure SDA as Input
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Configure SCL as Input
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		#ifndef MX_I2C_1
			#error "This chip does not have I2C channel 1 defined"
		#else
		  #ifdef MX_I2C_SLEW												//Slew Rate Control
			if (MX_I2C_BMODE_X & 0x01)
				I2C1CONbits.DISSLW = 0;										//Slew Rate Control Enabled
			else
				I2C1CONbits.DISSLW = 1;										//Slew Rate Control Disabled
		  #else
		  	I2C1CONbits.DISSLW = 1;											//Slew Rate Control Disabled
		  #endif
		  #ifdef MX_I2C_SMBUS												//SMBus Control
			if (MX_I2C_BMODE_X & 0x02)
				I2C1CONbits.SMEN = 1;										//Enable SMBus specific inputs
			else
				I2C1CONbits.SMEN = 0;										//Disable SMBus specific inputs
		  #else
		  	I2C1CONbits.SMEN = 0;											//Disable SMBus specific inputs
		  #endif
			I2C1CONbits.I2CEN = 1;											//Enable I2C Peripheral
			I2C1BRG = MX_I2C_HW_BAUD;										//Set the Baud Rate
		#endif
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		#ifndef MX_I2C_2
			#error "This chip does not have I2C channel 2 defined"
		#else
		  #ifdef MX_I2C_SLEW												//Slew Rate Control
			if (MX_I2C_BMODE_X & 0x01)
				I2C2CONbits.DISSLW = 0;										//Slew Rate Control Enabled
			else
				I2C2CONbits.DISSLW = 1;										//Slew Rate Control Disabled
		  #else
		  	I2C2CONbits.DISSLW = 1;											//Slew Rate Control Disabled
		  #endif
		  #ifdef MX_I2C_SMBUS												//SMBus Control
			if (MX_I2C_BMODE_X & 0x02)
				I2C2CONbits.SMEN = 1;										//Enable SMBus specific inputs
			else
				I2C2CONbits.SMEN = 0;										//Disable SMBus specific inputs
		  #else
		  	I2C2CONbits.SMEN = 0;											//Disable SMBus specific inputs
		  #endif
			I2C2CONbits.I2CEN = 1;											//Enable I2C Peripheral
			I2C2BRG = MX_I2C_HW_BAUD;										//Set the Baud Rate
		#endif
	#endif

