BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_I2C.c
	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		#ifndef MX_I2C_3
			#error "This chip does not have I2C channel 3 defined"
		#else
		  #ifdef MX_I2C_SLEW												//Slew Rate Control
			if (MX_I2C_BMODE_X & 0x01)
				I2C3CONbits.DISSLW = 0;										//Slew Rate Control Enabled
			else
				I2C3CONbits.DISSLW = 1;										//Slew Rate Control Disabled
		  #else
		  	I2C3CONbits.DISSLW = 1;											//Slew Rate Control Disabled
		  #endif
		  #ifdef MX_I2C_SMBUS												//SMBus Control
			if (MX_I2C_BMODE_X & 0x02)
				I2C3CONbits.SMEN = 1;										//Enable SMBus specific inputs
			else
				I2C3CONbits.SMEN = 0;										//Disable SMBus specific inputs
		  #else
		  	I2C3CONbits.SMEN = 0;											//Disable SMBus specific inputs
		  #endif
			I2C3CONbits.I2CEN = 1;											//Enable I2C Peripheral
			I2C3BRG = MX_I2C_HW_BAUD;										//Set the Baud Rate
		#endif
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		#ifndef MX_I2C_4
			#error "This chip does not have I2C channel 4 defined"
		#else
		  #ifdef MX_I2C_SLEW												//Slew Rate Control
			if (MX_I2C_BMODE_X & 0x01)
				I2C4CONbits.DISSLW = 0;										//Slew Rate Control Enabled
			else
				I2C4CONbits.DISSLW = 1;										//Slew Rate Control Disabled
		  #else
		  	I2C4CONbits.DISSLW = 1;											//Slew Rate Control Disabled
		  #endif
		  #ifdef MX_I2C_SMBUS												//SMBus Control
			if (MX_I2C_BMODE_X & 0x02)
				I2C4CONbits.SMEN = 1;										//Enable SMBus specific inputs
			else
				I2C4CONbits.SMEN = 0;										//Disable SMBus specific inputs
		  #else
		  	I2C4CONbits.SMEN = 0;											//Disable SMBus specific inputs
		  #endif
			I2C4CONbits.I2CEN = 1;											//Enable I2C Peripheral
			I2C4BRG = MX_I2C_HW_BAUD;										//Set the Baud Rate
		#endif
	#endif
}

CALFUNCTION(void, FC_CAL_I2C_Master_Uninit_, (void))
{
	#if (MX_I2C_CHANNEL_X == 0)															//Use Master I2C Software
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Configure SDA as Input
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Configure SCL as Input
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		I2C1CON = 0;														//Disable SSP
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		I2C2CON = 0;														//Disable SSP
	#endif

	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		I2C3CON = 0;														//Disable SSP
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		I2C4CON = 0;														//Disable SSP
	#endif
}

CALFUNCTION(void, FC_CAL_I2C_Master_Start_, (void))
{
	#if (MX_I2C_CHANNEL_X == 0)															//Use Master I2C Software
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Make Sure SCL is Set
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Make Sure SDA is Set
		MX_I2C_DELAY;																	//Small Delay
		FC_CAL_Bit_Low_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Clear SDA
		MX_I2C_DELAY;																	//Small Delay
		FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Clear SCL
		//MX_I2C_DELAY;																	//Small Delay //Removed 050613 - BR
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		I2C1CONbits.SEN = 1;												//Initiate start condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1CONbits.SEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for start bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		I2C2CONbits.SEN = 1;												//Initiate start condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2CONbits.SEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for start bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		I2C3CONbits.SEN = 1;												//Initiate start condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3CONbits.SEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for start bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		I2C4CONbits.SEN = 1;												//Initiate start condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4CONbits.SEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for start bit to be generated
	#endif
}

CALFUNCTION(void, FC_CAL_I2C_Master_Restart_, (void))
{
	#if (MX_I2C_CHANNEL_X == 0)															//Use Master I2C Software
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Set SDA High
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL High
		MX_I2C_DELAY;
		FC_CAL_Bit_Low_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Set SDA Low
		MX_I2C_DELAY;
		FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL Low
		//MX_I2C_DELAY;																	//Removed 050613 - BR
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		I2C1CONbits.RSEN = 1;												//Initiate restart condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1CONbits.RSEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for restart bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		I2C2CONbits.RSEN = 1;												//Initiate restart condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2CONbits.RSEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for restart bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		I2C3CONbits.RSEN = 1;												//Initiate restart condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3CONbits.RSEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for restart bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		I2C4CONbits.RSEN = 1;												//Initiate restart condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4CONbits.RSEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for restart bit to be generated
	#endif
}

CALFUNCTION(void, FC_CAL_I2C_Master_Stop_, (void))
{
	#if (MX_I2C_CHANNEL_X == 0)															//Use Master I2C Software
		FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL Low
		FC_CAL_Bit_Low_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Set SDA Low
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL High
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);		//Set SDA High
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		I2C1CONbits.PEN = 1;												//Initiate stop condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1CONbits.PEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for stop bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		I2C2CONbits.PEN = 1;												//Initiate stop condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2CONbits.PEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for stop bit to be generated
	#endif

