BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_I2C.c
	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		I2C3CONbits.PEN = 1;												//Initiate stop condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3CONbits.PEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for stop bit to be generated
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		I2C4CONbits.PEN = 1;												//Initiate stop condition
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4CONbits.PEN == 1 && MX_I2C_TIMEOUT_X--);										//Wait for stop bit to be generated
	#endif

	#if (MX_I2C_STOPDEL_X == 1)
		delay_ms(10);														//Wait before reusing the I2C BUS
	#endif
}

CALFUNCTION(MX_UINT8, FC_CAL_I2C_Master_TxByte_, (MX_UINT8 Data))
{
	#if (MX_I2C_CHANNEL_X == 0)												//Use Master I2C Software
		MX_UINT8 bit_mask;
		MX_UINT8 local_ack = 0;
		for(bit_mask=0x80;bit_mask;bit_mask=bit_mask>>1)
		{
			if(Data & bit_mask)
			{
				FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);	//Set SDA High
			}
			else
			{
				FC_CAL_Bit_Low_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);	//Set SDA Low
			}
			MX_I2C_DELAY;
			FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL High
			MX_I2C_DELAY;

			#if (MX_I2C_CLKSTRCH_X == 1)
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (FC_CAL_Bit_In(MX_I2C_SCL_PORT_X, MX_I2C_SCL_PIN_X) == 0 && MX_I2C_TIMEOUT_X--);		//Wait for the clock to go high - Clock stretching.
			#endif

			FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL Low
			//MX_I2C_DELAY;																	//Removed 050613 - BR
		}
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);			//Set SDA High
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);			//Set SCL High
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);
		if (FC_CAL_Bit_In(MX_I2C_SDA_PORT_X, MX_I2C_SDA_PIN_X))		//Get the Status Bit
			local_ack = 1;
		//MX_I2C_DELAY;																	//Small Delay //Removed 050613 - BR
		FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);			//Set SCL Low
		//MX_I2C_DELAY;																	//Removed 050613 - BR
		return (local_ack);													//0 = Ack received : 1 = Ack not received
	#endif

	#if (MX_I2C_CHANNEL_X == 1)												//Use Master I2C Hardware 1
		I2C1TRN = Data;														//Send byte
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1STATbits.TRSTAT == 1 && MX_I2C_TIMEOUT_X--);									//Wait for data byte to be sent
		if(I2C1STATbits.ACKSTAT == 1)										//Check Acknowledgement
			return (1);														//No Acknowledgement
		else return (0);													//Acknowledgement received
	#endif

	#if (MX_I2C_CHANNEL_X == 2)												//Use Master I2C Hardware 2
		I2C2TRN = Data;														//Send byte
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2STATbits.TRSTAT == 1 && MX_I2C_TIMEOUT_X--);									//Wait for data byte to be sent
		if(I2C2STATbits.ACKSTAT == 1)										//Check Acknowledgement
			return (1);														//No Acknowledgement
		else return (0);													//Acknowledgement received
	#endif

	#if (MX_I2C_CHANNEL_X == 3)												//Use Master I2C Hardware 3
		I2C3TRN = Data;														//Send byte
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3STATbits.TRSTAT == 1 && MX_I2C_TIMEOUT_X--);									//Wait for data byte to be sent
		if(I2C3STATbits.ACKSTAT == 1)										//Check Acknowledgement
			return (1);														//No Acknowledgement
		else return (0);													//Acknowledgement received
	#endif

	#if (MX_I2C_CHANNEL_X == 4)												//Use Master I2C Hardware 4
		I2C4TRN = Data;														//Send byte
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4STATbits.TRSTAT == 1 && MX_I2C_TIMEOUT_X--);									//Wait for data byte to be sent
		if(I2C4STATbits.ACKSTAT == 1)										//Check Acknowledgement
			return (1);														//No Acknowledgement
		else return (0);													//Acknowledgement received
	#endif
}

CALFUNCTION(MX_UINT8, FC_CAL_I2C_Master_RxByte_, (MX_UINT8 Last))
{
	#if (MX_I2C_CHANNEL_X == 0)												//Use Master I2C Software
		MX_UINT8 bit_mask;
		MX_UINT8 Data = 0;
		FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);			//Set SDA High
		MX_I2C_DELAY;
		for(bit_mask=0x80;bit_mask;bit_mask=bit_mask>>1)
		{
			FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL High
			MX_I2C_DELAY;

			#if (MX_I2C_CLKSTRCH_X == 1)
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (FC_CAL_Bit_In(MX_I2C_SCL_PORT_X, MX_I2C_SCL_PIN_X) == 0 && MX_I2C_TIMEOUT_X--);		//Wait for the clock to go high - Clock stretching.
			#endif

			FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);
			if(FC_CAL_Bit_In(MX_I2C_SDA_PORT_X, MX_I2C_SDA_PIN_X))	//Read Incoming Bit
				Data = Data | bit_mask;														//Add data to variable
			FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL Low
			MX_I2C_DELAY;																	//BR
		}
		if (Last)																		//Acknowledge?
		{
			FC_CAL_Bit_In_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);	//Send Nack
		}
		else
		{
			FC_CAL_Bit_Low_DDR(MX_I2C_SDA_PORT_X, MX_I2C_SDA_TRIS_X, MX_I2C_SDA_PIN_X);	//Send Ack
		}
		MX_I2C_DELAY;
		FC_CAL_Bit_In_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL High
		MX_I2C_DELAY;
		FC_CAL_Bit_Low_DDR(MX_I2C_SCL_PORT_X, MX_I2C_SCL_TRIS_X, MX_I2C_SCL_PIN_X);		//Set SCL Low
		//MX_I2C_DELAY;																	//Removed 050613 - BR
		return (Data);
	#endif

	#if (MX_I2C_CHANNEL_X == 1)						//Use Master I2C Hardware 1
		I2C1CONbits.RCEN = 1;						//Initiate Read
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1CONbits.RCEN == 1 && MX_I2C_TIMEOUT_X--);				//Wait for data read
		if (Last)
			I2C1CONbits.ACKDT = 1;					//Send Nack
		else I2C1CONbits.ACKDT = 0;					//Send Ack
		I2C1CONbits.ACKEN = 1;						//Initiate Nack
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C1CONbits.ACKEN && MX_I2C_TIMEOUT_X--);					//Wait for data read
		return(I2C1RCV);							//Store incoming data
	#endif

