BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_I2C.c
	#if (MX_I2C_CHANNEL_X == 2)						//Use Master I2C Hardware 2
		I2C2CONbits.RCEN = 1;						//Initiate Read
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2CONbits.RCEN == 1 && MX_I2C_TIMEOUT_X--);				//Wait for data read
		if (Last)
			I2C2CONbits.ACKDT = 1;					//Send Nack
		else I2C2CONbits.ACKDT = 0;					//Send Ack
		I2C2CONbits.ACKEN = 1;						//Initiate Nack
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C2CONbits.ACKEN && MX_I2C_TIMEOUT_X--);					//Wait for data read
		return(I2C2RCV);							//Store incoming data
	#endif

	#if (MX_I2C_CHANNEL_X == 3)						//Use Master I2C Hardware 3
		I2C3CONbits.RCEN = 1;						//Initiate Read
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3CONbits.RCEN == 1 && MX_I2C_TIMEOUT_X--);				//Wait for data read
		if (Last)
			I2C3CONbits.ACKDT = 1;					//Send Nack
		else I2C3CONbits.ACKDT = 0;					//Send Ack
		I2C3CONbits.ACKEN = 1;						//Initiate Nack
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C3CONbits.ACKEN && MX_I2C_TIMEOUT_X--);					//Wait for data read
		return(I2C3RCV);							//Store incoming data
	#endif

	#if (MX_I2C_CHANNEL_X == 4)						//Use Master I2C Hardware 4
		I2C4CONbits.RCEN = 1;						//Initiate Read
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4CONbits.RCEN == 1 && MX_I2C_TIMEOUT_X--);				//Wait for data read
		if (Last)
			I2C4CONbits.ACKDT = 1;					//Send Nack
		else I2C4CONbits.ACKDT = 0;					//Send Ack
		I2C4CONbits.ACKEN = 1;						//Initiate Nack
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while(I2C4CONbits.ACKEN && MX_I2C_TIMEOUT_X--);					//Wait for data read
		return(I2C4RCV);							//Store incoming data
	#endif
}


// Slave functionality

// nb. Not all processors support a Mask (e.g. dsPIC30F)
CALFUNCTION(void, FC_CAL_I2C_Slave_Init_, (MX_UINT8 Address, MX_UINT8 Mask))
{
	#if (MX_I2C_CHANNEL_X == 1)
		I2C1CON = 0b1000000001000000;
		I2C1ADD = (MX_UINT16)Address >> 1;
		#ifdef I2C1MSK
		I2C1MSK = (MX_UINT16)Mask >> 1;
		#endif
		#ifdef _SI2C1IF
		IFS1bits.SI2C1IF = 0;
		#else
		IFS0bits.SI2CIF = 0;
		#endif
	#endif
	#if (MX_I2C_CHANNEL_X == 2)
		I2C2CON = 0b1000000001000000;
		I2C2ADD = (MX_UINT16)Address >> 1;
		I2C2MSK = (MX_UINT16)Mask >> 1;
		IFS3bits.SI2C2IF = 0;
	#endif
	#if (MX_I2C_CHANNEL_X == 3)
		I2C3CON = 0b1000000001000000;
		I2C3ADD = (MX_UINT16)Address >> 1;
		I2C3MSK = (MX_UINT16)Mask >> 1;
		IFS5bits.SI2C3IF = 0;
	#endif
	#if (MX_I2C_CHANNEL_X == 4)
		I2C4CON = 0b1000000001000000;
		I2C4ADD = (MX_UINT16)Address >> 1;
		I2C4MSK = (MX_UINT16)Mask >> 1;
		IFS7bits.SI2C4IF = 0;
	#endif
}

// I2C is disabled via this function
CALFUNCTION(void, FC_CAL_I2C_Slave_Uninit_, (void))
{
	#if (MX_I2C_CHANNEL_X == 1)
		I2C1CON = 0;
	#endif
	#if (MX_I2C_CHANNEL_X == 2)
		I2C2CON = 0;
	#endif
	#if (MX_I2C_CHANNEL_X == 3)
		I2C3CON = 0;
	#endif
	#if (MX_I2C_CHANNEL_X == 4)
		I2C4CON = 0;
	#endif
}

// Data is sent and Ack/Nak from Master is returned
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_TxByte_, (MX_UINT8 Data))
{
	#if (MX_I2C_CHANNEL_X == 1)
		#ifdef _SI2C1IF
		IFS1bits.SI2C1IF = 0;
		#else
		IFS0bits.SI2CIF = 0;
		#endif
		I2C1TRN = Data;
		I2C1CONbits.SCLREL = 1;
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while ((I2C1CONbits.SCLREL)&&(I2C1STATbits.S) && MX_I2C_TIMEOUT_X--);
		#ifdef _SI2C1IF
		IFS1bits.SI2C1IF = 0;
		#else
		IFS0bits.SI2CIF = 0;
		#endif
		return ((I2C1STATbits.ACKSTAT) || (!I2C1STATbits.S))?1:0;
	#endif
	#if (MX_I2C_CHANNEL_X == 2)
		IFS3bits.SI2C2IF = 0;
		I2C2TRN = Data;
		I2C2CONbits.SCLREL = 1;
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while ((I2C2CONbits.SCLREL)&&(I2C2STATbits.S) && MX_I2C_TIMEOUT_X--);
		IFS3bits.SI2C2IF = 0;
		return ((I2C2STATbits.ACKSTAT) || (!I2C2STATbits.S))?1:0;
	#endif
	#if (MX_I2C_CHANNEL_X == 3)
		IFS5bits.SI2C3IF = 0;
		I2C3TRN = Data;
		I2C3CONbits.SCLREL = 1;
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while ((I2C3CONbits.SCLREL)&&(I2C3STATbits.S) && MX_I2C_TIMEOUT_X--);
		IFS5bits.SI2C3IF = 0;
		return ((I2C3STATbits.ACKSTAT) || (!I2C3STATbits.S))?1:0;
	#endif
	#if (MX_I2C_CHANNEL_X == 4)
		IFS7bits.SI2C4IF = 0;
		I2C4TRN = Data;
		I2C4CONbits.SCLREL = 1;
		MX_I2C_TIMEOUT_X = 0xFFFF;
		while ((I2C4CONbits.SCLREL)&&(I2C4STATbits.S) && MX_I2C_TIMEOUT_X--);
		IFS7bits.SI2C4IF = 0;
		return ((I2C4STATbits.ACKSTAT) || (!I2C4TATbits.S))?1:0;
	#endif
}

// When Last is true a Nak is sent, otherwise if Last = 0 then Ack is sent
// Not all processors support software Ack/Nak by the Slave,
// for some, such as dsPIC30F, the I2C peripheral hardware sends the Ack
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_RxByte_, (MX_UINT8 Last))
{
	#if (MX_I2C_CHANNEL_X == 1)
		MX_UINT8 Data;
		Data = I2C1RCV;
		#ifdef _SI2C1IF
		IFS1bits.SI2C1IF = 0;
		#ifdef _R_NOT_W
		if ((I2C1STATbits.D_NOT_A)&&(!I2C1STATbits.R_NOT_W))
		#else
		if ((I2C1STATbits.D_A)&&(!I2C1STATbits.R_W))
		#endif
		{
			// writing data to slave
			I2C1CONbits.ACKDT = Last?1:0;
			if (!Last)
			{
				I2C1CONbits.SCLREL = 1;
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (I2C1CONbits.SCLREL && MX_I2C_TIMEOUT_X--);
			}
		}
		I2C1CONbits.SCLREL = 1;
		#else
		// for dsPIC30F the Ack has already been sent to the Master
		IFS0bits.SI2CIF = 0;
		I2C1CONbits.SCLREL = 1;
		#endif
		return Data;
	#endif
	#if (MX_I2C_CHANNEL_X == 2)
		MX_UINT8 Data;
		Data = I2C2RCV;
		IFS3bits.SI2C2IF = 0;
		#ifdef _R_NOT_W
		if ((I2C2STATbits.D_NOT_A)&&(!I2C2STATbits.R_NOT_W))
		#else
		if ((I2C2STATbits.D_A)&&(!I2C2STATbits.R_W))
		#endif
		{
			// writing data to slave
			I2C2CONbits.ACKDT = Last?1:0;
			if (!Last)
			{
				I2C2CONbits.SCLREL = 1;
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (I2C2CONbits.SCLREL && MX_I2C_TIMEOUT_X--);
			}
		}
		I2C2CONbits.SCLREL = 1;
		return Data;
	#endif
	#if (MX_I2C_CHANNEL_X == 3)
		MX_UINT8 Data;
		Data = I2C3RCV;
		IFS5bits.SI2C3IF = 0;
		if ((I2C3STATbits.D_A)&&(!I2C3STATbits.R_W))
		{
			// writing data to slave
			I2C3CONbits.ACKDT = Last?1:0;
			if (!Last)
			{
				I2C3CONbits.SCLREL = 1;
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (I2C3CONbits.SCLREL && MX_I2C_TIMEOUT_X--);
			}
		}
		I2C3CONbits.SCLREL = 1;
		return Data;
	#endif
	#if (MX_I2C_CHANNEL_X == 4)
		MX_UINT8 Data;
		Data = I2C4RCV;
		IFS7bits.SI2C4IF = 0;
		if ((I2C4STATbits.D_A)&&(!I2C4STATbits.R_W))
		{
			// writing data to slave
			I2C4CONbits.ACKDT = Last?1:0;
			if (!Last)
			{
				I2C4CONbits.SCLREL = 1;
				MX_I2C_TIMEOUT_X = 0xFFFF;
				while (I2C4CONbits.SCLREL && MX_I2C_TIMEOUT_X--);
			}
		}
		I2C4CONbits.SCLREL = 1;
		return Data;
	#endif
}

