BenMatrixTSL/FlowcodeV11/CAL/PIC16BIT/PIC16BIT_CAL_I2C.c
// Returns the status of the I2C Slave
// This is used to poll for a received matching address.
// Bit 0 = 1 Indicates address/data byte available in the buffer to read
// Bit 2 = 1 Indicates a Read, else 0 indicates a Write
// Bit 3 = 1 Indicates Start bit detected
// Bit 4 = 1 Indicates Stop bit detected
// Bit 5 = 1 Indicates that the last byte received (or transmitted?) was data (else address)
CALFUNCTION(MX_UINT8, FC_CAL_I2C_Slave_Status_, (void))
{
	#if (MX_I2C_CHANNEL_X == 1)
		MX_UINT8 Status = 0;
		#ifdef _SI2C1IF
		if (IFS1bits.SI2C1IF) Status |= 1;
		#else
		if (IFS0bits.SI2CIF) Status |= 1;
		#endif
		#ifdef _R_NOT_W
		if (I2C1STATbits.R_NOT_W) Status |= 4;
		#else
		if (I2C1STATbits.R_W) Status |= 4;
		#endif
		if (I2C1STATbits.S) Status |= 8;
		if (I2C1STATbits.P) Status |= 0x10;
		#ifdef _D_NOT_A
		if (I2C1STATbits.D_NOT_A) Status |= 0x20;
		#else
		if (I2C1STATbits.D_A) Status |= 0x20;
		#endif
		return (Status);
	#endif
	#if (MX_I2C_CHANNEL_X == 2)
		MX_UINT8 Status = 0;
		if (IFS3bits.SI2C2IF) Status |= 1;
		#ifdef _R_NOT_W
		if (I2C2STATbits.R_NOT_W) Status |= 4;
		#else
		if (I2C2STATbits.R_W) Status |= 4;
		#endif
		if (I2C2STATbits.S) Status |= 8;
		if (I2C2STATbits.P) Status |= 0x10;
		#ifdef _D_NOT_A
		if (I2C2STATbits.D_NOT_A) Status |= 0x20;
		#else
		if (I2C2STATbits.D_A) Status |= 0x20;
		#endif
		return (Status);
	#endif
	#if (MX_I2C_CHANNEL_X == 3)
		MX_UINT8 Status = 0;
		if (IFS5bits.SI2C3IF) Status |= 1;
		if (I2C3STATbits.R_W) Status |= 4;
		if (I2C3STATbits.S) Status |= 8;
		if (I2C3STATbits.P) Status |= 0x10;
		if (I2C3STATbits.D_A) Status |= 0x20;
		return (Status);
	#endif
	#if (MX_I2C_CHANNEL_X == 4)
		MX_UINT8 Status = 0;
		if (IFS7bits.SI2C4IF) Status |= 1;
		if (I2C4STATbits.R_W) Status |= 4;
		if (I2C4STATbits.S) Status |= 8;
		if (I2C4STATbits.P) Status |= 0x10;
		if (I2C4STATbits.D_A) Status |= 0x20;
		return (Status);
	#endif
}






/**************************************************
	Master Transaction functions
**************************************************/

#define MX_I2C_ADDRESS_X		CAL_APPEND(MX_I2C_ADDRESS_, MX_I2C_NUM)
#define MX_I2C_INIT_X			CAL_APPEND(MX_I2C_INIT_, MX_I2C_NUM)

MX_UINT8 MX_I2C_ADDRESS_X;
MX_UINT8 MX_I2C_INIT_X = 0;


CALFUNCTION(MX_UINT8, FC_CAL_I2C_Transaction_Init_,   (MX_UINT8 SlaveAddress))
{
	MX_I2C_ADDRESS_X = SlaveAddress;

	if (MX_I2C_INIT_X == 0)
	{
		MX_I2C_INIT_X = 1;
		CALFUNCTION(, FC_CAL_I2C_Master_Init_, ());
	}
	return 1;	// Success
}

CALFUNCTION(MX_UINT16, FC_CAL_I2C_Transaction_Read_,   (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length))
{
	if (Length > Size) return 0;
	MX_UINT16 n = 0;
	CALFUNCTION( , FC_CAL_I2C_Master_Start_, ());
	if ( CALFUNCTION( , FC_CAL_I2C_Master_TxByte_, ((MX_I2C_ADDRESS_X<<1)|1)))
		return 0;
	while (n < Length)
	{
		Buffer[n] = CALFUNCTION(, FC_CAL_I2C_Master_RxByte_, ((n+1==Length)?1:0));
		++n;
	}
	CALFUNCTION( , FC_CAL_I2C_Master_Stop_, ());
	return n;
}

CALFUNCTION(MX_UINT16, FC_CAL_I2C_Transaction_Write_,  (MX_UINT8* Buffer, MX_UINT16 Size, MX_UINT16 Length))
{
	MX_UINT8 sendStop = 1;
	if (Length & 0x8000)
	{
		Length = Length & 0x7FFF;
		sendStop = 0;
	}
	if (Length > Size) return 0;
	MX_UINT16 n = 0;
	CALFUNCTION( , FC_CAL_I2C_Master_Start_, ());
	if ( CALFUNCTION( , FC_CAL_I2C_Master_TxByte_, (MX_I2C_ADDRESS_X<<1)))
					return 0;
	while (n < Length)
	{
		if ( CALFUNCTION( , FC_CAL_I2C_Master_TxByte_, (Buffer[n])))
			break;
		++n;
	}
	if (sendStop)
		CALFUNCTION( , FC_CAL_I2C_Master_Stop_, ());
	return n;
}

CALFUNCTION(void,     FC_CAL_I2C_Transaction_Uninit_, (void))
{
	CALFUNCTION(, FC_CAL_I2C_Master_Uninit_, ());
}
